; domain
;; DOMAIN FILE - pedro.pddl
(define (domain pedro)
  (:requirements :strips :typing)

  (:types
    lata - object
    almacen - object
  )

  (:predicates
    (lata_almacen ?l - lata ?a - almacen)
    (pinza_libre)
    (pinza_ocupada)
    (lata_cogida ?l - lata ?a - almacen)
    (lata_transportandose ?l - lata ?a1 - almacen ?a2 - almacen)
    (moviendose_a_almacen ?l - lata ?a - almacen)
    (en_posicion ?l - lata ?a - almacen)
    (lata_procesada ?l - lata)
  )

  ;; Preparar movimiento
  (:action a_mover_a_lata
    :parameters (?l - lata ?a - almacen)
    :precondition (and
      (pinza_libre)
      (not (pinza_ocupada))
      (lata_almacen ?l ?a)
      (not (moviendose_a_almacen ?l ?a))
      (not (lata_procesada ?l))
    )
    :effect (and
      (moviendose_a_almacen ?l ?a)
    )
  )

  ;; Coger lata
  (:action a_coger_lata
    :parameters (?l - lata ?a - almacen)
    :precondition (and
      (pinza_libre)
      (not (pinza_ocupada))
      (lata_almacen ?l ?a)
      (moviendose_a_almacen ?l ?a)
    )
    :effect (and
      (not (pinza_libre))
      (pinza_ocupada)
      (not (lata_almacen ?l ?a))
      (lata_cogida ?l ?a)
      (not (moviendose_a_almacen ?l ?a))
    )
  )

  ;; Mover lata entre almacenes
  (:action a_mover_lata
    :parameters (?l - lata ?a1 - almacen ?a2 - almacen)
    :precondition (and
      (pinza_ocupada)
      (not (pinza_libre))
      (lata_cogida ?l ?a1)
      (not (= ?a1 ?a2))
    )
    :effect (and
      (lata_transportandose ?l ?a1 ?a2)
    )
  )

  ;; Dejar lata
  (:action a_dejar_lata
    :parameters (?l - lata ?a1 - almacen ?a2 - almacen)
    :precondition (and
      (pinza_ocupada)
      (not (pinza_libre))
      (lata_cogida ?l ?a1)
      (lata_transportandose ?l ?a1 ?a2)
    )
    :effect (and
      (pinza_libre)
      (not (pinza_ocupada))
      (lata_almacen ?l ?a2)
      (en_posicion ?l ?a2)
      (lata_procesada ?l)
      (not (lata_cogida ?l ?a1))
      (not (lata_transportandose ?l ?a1 ?a2))
    )
  )
)

; problem
;; PROBLEM FILE - pedro_p.pddl
(define (problem pedro_p)
  (:domain pedro)

  (:objects
    l1 l2 l3 l4 l5 l6 - lata
    a1 a2 a3 a4 a5 a6 a7 a8 - almacen
  )

  (:init
    (pinza_libre)
    (lata_almacen l1 a1)
    (lata_almacen l2 a2)
    (lata_almacen l3 a3)
    (lata_almacen l4 a4)
    (lata_almacen l5 a5)
    (lata_almacen l6 a8)
  )

  (:goal (and
    (lata_almacen l1 a6)
    (lata_almacen l2 a6)
    (lata_almacen l3 a6)
    (lata_almacen l4 a7)
    (lata_almacen l5 a7)
    (lata_almacen l6 a7)
  ))
)

; plan
1. (a_mover_a_lata l3 a3)
   added: (moviendose_a_almacen l3 a3)
   goals met: 0 of 6
2. (a_coger_lata l3 a3)
   deleted: (pinza_libre) (lata_almacen l3 a3) (moviendose_a_almacen l3 a3)
   added: (pinza_ocupada) (lata_cogida l3 a3)
   goals met: 0 of 6
3. (a_mover_lata l3 a3 a6)
   added: (lata_transportandose l3 a3 a6)
   goals met: 0 of 6
4. (a_dejar_lata l3 a3 a6)
   deleted: (pinza_ocupada) (lata_cogida l3 a3) (lata_transportandose l3 a3 a6)
   added: (pinza_libre) (lata_almacen l3 a6) (en_posicion l3 a6) (lata_procesada l3)
   goals met: 1 of 6
5. (a_mover_a_lata l5 a5)
   added: (moviendose_a_almacen l5 a5)
   goals met: 1 of 6
6. (a_coger_lata l5 a5)
   deleted: (pinza_libre) (lata_almacen l5 a5) (moviendose_a_almacen l5 a5)
   added: (pinza_ocupada) (lata_cogida l5 a5)
   goals met: 1 of 6
7. (a_mover_lata l5 a5 a7)
   added: (lata_transportandose l5 a5 a7)
   goals met: 1 of 6
8. (a_dejar_lata l5 a5 a7)
   deleted: (pinza_ocupada) (lata_cogida l5 a5) (lata_transportandose l5 a5 a7)
   added: (pinza_libre) (lata_almacen l5 a7) (en_posicion l5 a7) (lata_procesada l5)
   goals met: 2 of 6
9. (a_mover_a_lata l6 a8)
   added: (moviendose_a_almacen l6 a8)
   goals met: 2 of 6
10. (a_coger_lata l6 a8)
   deleted: (pinza_libre) (lata_almacen l6 a8) (moviendose_a_almacen l6 a8)
   added: (pinza_ocupada) (lata_cogida l6 a8)
   goals met: 2 of 6
11. (a_mover_lata l6 a8 a7)
   added: (lata_transportandose l6 a8 a7)
   goals met: 2 of 6
12. (a_dejar_lata l6 a8 a7)
   deleted: (pinza_ocupada) (lata_cogida l6 a8) (lata_transportandose l6 a8 a7)
   added: (pinza_libre) (lata_almacen l6 a7) (en_posicion l6 a7) (lata_procesada l6)
   goals met: 3 of 6
13. (a_mover_a_lata l1 a1)
   added: (moviendose_a_almacen l1 a1)
   goals met: 3 of 6
14. (a_coger_lata l1 a1)
   deleted: (pinza_libre) (lata_almacen l1 a1) (moviendose_a_almacen l1 a1)
   added: (pinza_ocupada) (lata_cogida l1 a1)
   goals met: 3 of 6
15. (a_mover_lata l1 a1 a6)
   added: (lata_transportandose l1 a1 a6)
   goals met: 3 of 6
16. (a_dejar_lata l1 a1 a6)
   deleted: (pinza_ocupada) (lata_cogida l1 a1) (lata_transportandose l1 a1 a6)
   added: (pinza_libre) (lata_almacen l1 a6) (en_posicion l1 a6) (lata_procesada l1)
   goals met: 4 of 6
17. (a_mover_a_lata l2 a2)
   added: (moviendose_a_almacen l2 a2)
   goals met: 4 of 6
18. (a_coger_lata l2 a2)
   deleted: (pinza_libre) (lata_almacen l2 a2) (moviendose_a_almacen l2 a2)
   added: (pinza_ocupada) (lata_cogida l2 a2)
   goals met: 4 of 6
19. (a_mover_lata l2 a2 a6)
   added: (lata_transportandose l2 a2 a6)
   goals met: 4 of 6
20. (a_dejar_lata l2 a2 a6)
   deleted: (pinza_ocupada) (lata_cogida l2 a2) (lata_transportandose l2 a2 a6)
   added: (pinza_libre) (lata_almacen l2 a6) (en_posicion l2 a6) (lata_procesada l2)
   goals met: 5 of 6
21. (a_mover_a_lata l4 a4)
   added: (moviendose_a_almacen l4 a4)
   goals met: 5 of 6
22. (a_coger_lata l4 a4)
   deleted: (pinza_libre) (lata_almacen l4 a4) (moviendose_a_almacen l4 a4)
   added: (pinza_ocupada) (lata_cogida l4 a4)
   goals met: 5 of 6
23. (a_mover_lata l4 a4 a7)
   added: (lata_transportandose l4 a4 a7)
   goals met: 5 of 6
24. (a_dejar_lata l4 a4 a7)
   deleted: (pinza_ocupada) (lata_cogida l4 a4) (lata_transportandose l4 a4 a7)
   added: (pinza_libre) (lata_almacen l4 a7) (en_posicion l4 a7) (lata_procesada l4)
   goals met: 6 of 6
